Repository: Gurux/Gurux.DLMS.AMI4
Catalog: Gurux.DLMS.AMI/Gurux.DLMS.AMI/Server/Properties/Resources.*.resx
Languages: fi

source: Device Id is zero.
fi: Laitetunnus on tyhjä.

source: Invalid email address.
fi: Epäkelpo sähköpostiosoite.

source: Site Name
fi: Sivuston nimi

# SiteNameDescription
source: Site Name
fi: Sivuston nimi

# SiteEmailAddress
source: Email
fi: Sähköposti

# SiteEmailAddressDescription
source: Site email address. This address is used when emails are sent.
fi: Sivuston sähköpostiosoite. Tätä osoitetta käytetään sähköpostien lähettämiseen.

source: Site slocan
fi: Sivuston iskulause

# SiteSlocanDescription
source: Site slogan.
fi: Sivuston iskulause.

source: Site Status
fi: Tila

# SiteVersion
source: Version
fi: Versio

# SiteVersionDescription
source: Site version
fi: Versio

source: System
fi: Järjestelmä

# SystemSiteInformation
source: Site information
fi: Sivuston tiedot

# SystemConfigurationDescription
source: Change site name, e-mail address or slogan.
fi: Muuta sivuston nimi, sähköpostiosoite tai iskulause.

# SystemStatus
source: Status
fi: Tila

# SystemStatusInformation
source: Status status
fi: Tila

# SystemStatusDescription
source: System status information.
fi: Järjestelmän tila.

source: Logout
fi: Kirjaudu ulos

source: Hello
fi: Hei

source: Login
fi: Kirjaudu sisään

source: Name
fi: Nimi

source: Email
fi: Sähköposti

source: Phone number
fi: Puhelinnumero

source: Date of birth
fi: Syntymäaika

# Language
source: Used Language
fi: Kieli

source: Password
fi: Salasana

source: Personal data
fi: Henkilökohtaiset tiedot

source: Profile
fi: Profiili

source: Roles
fi: Roolit

source: Two-factor authentication
fi: Kaksivaiheinen todennus

source: External logins
fi: Ulkoiset kirjautumiset

# SystemSecurityDescription
source: System security information.
fi: Järjestelmän suojaustiedot.

source: Security
fi: Turvallisuus

source: System security
fi: systeemin turvallisuus

source: Password options
fi: Salasanavaihtoehdot

source: Password Length
fi: Salasanan pituus

source: Unique characters
fi: Yksilöllisiä merkkejä

source: Require non alphanumeric
fi: Vaadi ei-aakkosnumeerinen kirjain

source: Require lowercase
fi: Pieniä kirjaimia edellytetään

source: Require uppercase
fi: Isoja kirjaimia edellytetään

source: Require digit
fi: Numero edellytetään

source: Lockout options
fi: Lukitusvaihtoehdot

source: Max Failed Access Attempts
fi: Suurin mahdollinen epäonnistunut pääsyyritys

source: Default lockout time span
fi: Oletussulkuaika

source: Sign in options
fi: Kirjautumisvaihtoehdot

source: Require confirmed email
fi: Vaadi vahvistettu sähköposti

source: Require confirmed account
fi: Vaadi vahvistettu tili

source: System security settings.
fi: Järjestelmän suojausasetukset.

source: The minimum length a password must be. Defaults to 6.
fi: Salasanan vähimmäispituus. Oletus on kuusi merkkiä.

source: The minimum number of unique characters which a password must contain
fi: Yksilöllisten merkkien vähimmäismäärä, jonka salasanassa on oltava

source: Passwords must contain a non-alphanumeric character.
fi: Salasanan tulee sisältää ei-aakkosnumeerinen merkki.

source: Passwords must contain a lower case ASCII character.
fi: Salasanassa tulee olla pieniä ASCII-merkkejä.

source: Passwords must contain a upper case ASCII character.
fi: Salasanassa tulee olla suuria ASCII-merkkejä.

source: Passwords must contain a digit.
fi: Salasanan pitää sisältää numero.

source: A user must have a confirmed account before they can sign in.
fi: Käyttäjällä on oltava vahvistettu tili, ennen kuin hän voi kirjautua sisään.

source: A user must have a confirmed email address before they can sign in.
fi: Käyttäjällä on oltava vahvistettu sähköpostiosoite, ennen kuin hän voi kirjautua sisään.

source: Localized resource is missing.
fi: Lokalisoitu resurssi puuttuu.

source: Options for configuring sign in.
fi: Vaihtoehdot kirjautumisen määrittämiseen.

source: The lock out time in minutes if a user is locked out for when a lockout occurs.
fi: Lukitusaika minuutteina, jos käyttäjä on lukittu ulos lukituksen tapahtuessa.

source: The number of failed access attempts allowed before a user is locked out, if lockout is enabled.
fi: Sallittujen epäonnistuneiden pääsy-yritysten määrä ennen käyttäjän lukitsemista, jos lukitus on käytössä.

source: System exception:
fi: Järjestelmävirhe:

source: Personal Access Tokens
fi: Henkilökohtaiset käyttötunnukset

# LocalizedResourceDublicate
source: Dual value of a localized resource.
fi: lokalisoidun resurssin kaksoisarvo.

source: Creation Time
fi: Luomisaika

source: Expiration
fi: Voimassaolon päättyminen

source: Add
fi: Lisää

source: Delete
fi: Poista

source: Save
fi: Tallenna

source: Cancel
fi: Peruuta

source: Create
fi: Luo

source: Clear
fi: Tyhjää

source: Close
fi: Sulje

source: View
fi: Näytä

source: Edit
fi: Muokkaa

source: Copy
fi: Kopioi

source: Succeeded
fi: Onnistui

# TokenCreateInfo
source: Warning - Make sure you copy the above token now. It's not stored it and you will not be able to see it again.
fi: Varoitus – Varmista, että kopioit yllä olevan tunnuksen nyt. Sitä ei tallenneta etkä voi nähdä sitä uudelleen.

# TokenCreateSucceeded
source: You have successfully added a new personal access token. Copy the token now!
fi: Olet lisännyt uuden henkilökohtaisen käyttötunnuksen. Kopioi tunnus nyt!

source: Your profile has been updated
fi: Profiilisi on päivitetty

source: Profile picture
fi: Profillikuva

# ModuleInstallationUnknownService
source: Module installation failed. Module requires {0} service that is not intalled.
fi: Moduulin asennus epäonnistui. Moduuli vaatii {0} palvelua, jota ei ole upotettu.

# UnknownModule
source: Unknown module {0}.
fi: ﻿Tuntematon moduuli {0}.

source: Configuration
fi: Konfiguraatio

source: Module
fi: Moduuli

source: Given name
fi: Etunimi

source: Surname
fi: Sukunimi

source: Array is empty.
fi: Matriisi on tyhjä.

# YouCanRemoveYourself
source: You can't remove yourself.
fi: Et voi poistaa itseäsi.

source: Default
fi: Oletusarvo

source: Minutely
fi: Minuutittainen

source: Hourly
fi: Tunneittain

source: Daily
fi: Päivittäin

# ContentEdited
source: Update failed. Content has been edited by another user.
fi: Päivitys epäonnistui. Toinen käyttäjä on muokannut sisältöä.

source: Users must belong to at least one user group.
fi: Käyttäjien on kuuluttava vähintään yhteen käyttäjäryhmään.

source: Invalid user role. At least one role must be selected.
fi: Virheellinen käyttäjärooli. Ainakin yksi rooli on valittava.

source: Invalid name.
fi: Virheellinen nimi.

source: Invalid start time.
fi: Virheellinen aloitusaika.

source: Invalid Id.
fi: Väärä tunniste.

source: Unknown task target.
fi: Tuntematon tehtävän kohde.

source: Cron
fi: Ajastustin

source: Agents
fi: Agentit

# CronDescription
source: Cron takes care of running periodic tasks like checking for updates.
fi: Cron huolehtii säännöllisistä tehtävistä, kuten päivitysten tarkistamisesta.

# CronTitle
source: Manage automatic site maintenance tasks.
fi: Hallinnoi sivuston automaattisia kunnossapitotehtäviä.

source: Workflows
fi: Työnkulut

source: Triggers
fi: Liipaisimet

source: Component views
fi: Komponenttinäkymät

source: Modules
fi: Moduulit

source: Regional and language
fi: Alue ja kieli

source: Scripts
fi: Skriptit

source: Status
fi: Tila

source: Maintenance
fi: Huolto

source: Blocks
fi: Lohkot

# StatisticDescription
source: Statisics helps to improve the site reaction speed.
fi: Tilastot auttavat parantamaan sivuston reaktionopeutta.

source: Statistic
fi: Tilasto

source: Scheduler service is starting.
fi: Aikatauluttajapalvelu alkaa.

source: Scheduler service is working.
fi: Ajastinpalvelu toimii.

source: Scheduler service is stopping.
fi: Ajastinpalvelu pysähtyy.

# RolesDescription
source: Roles are used to manage permissions.
fi: Rooleja käytetään käyttöoikeuksien hallintaan.

# TargetMustBelongToOneGroup
source: Target must belong to at least one group.
fi: Kohteen pitää kuulua ainakin yhteen ryhmään.

source: Unknown target.
fi: Tuntematon kohde.

source: Connected
fi: Yhdistetty

source: Performance
fi: Suorituskyky

# PerformanceDescription
source: Enable or disable notification to improve performance for large amounts of meters.
fi: Ota ilmoitus käyttöön tai poista se käytöstä parantaaksesi suorituskykyä suurille mittarimäärille.

source: Cron started.
fi: Cron aloitettu.

source: Cron completed.
fi: Cron valmis.

# ExternalAuthenticationDescription
source: External authentications allows logging in via external services.
fi: Ulkoiset todennukset mahdollistavat kirjautumisen ulkoisten palvelujen kautta.

source: Error
fi: Virhe

source: Downloading...
fi: Ladataan...

source: Updating...
fi: Päivitetään...

source: Restarting...
fi: Käynnistetään uudelleen...

source: Agent
fi: Agentti

source: Module disabled.
fi: Moduulit otettu käytöstä.

source: Module enabled.
fi: Moduuli otettu käyttöön.

source: Module removed.
fi: Moduuli poistettu.

source: Module installed.
fi: Moduuli asennettu.

source: Device
fi: Laite

source: Device template
fi: Laitepohja

source: Device template group
fi: Laitepohja ryhmä

source: Workflow installed.
fi: Työnkulku asennettu.

source: Workflow removed.
fi: Työnkulku poistettu.

source: Script installed.
fi: Komentosarja asennettu.

source: Script removed.
fi: Komentosarja poistettu.

source: Schedule installed.
fi: Aikataulu asennettu.

source: Schedule removed.
fi: Aikataulu poistettu.

source: Script updated.
fi: Komentosarja päivitetty.

source: Workflow updated.
fi: Työnkulku päivitetty.

source: Schedule updated.
fi: Aikataulu päivitetty.
